/*************************************************************************
    > File Name:    test1.c
    > Author:       Hunter
    > Mail:         hunter.520@qq.com 
    > Created Time: Wed 10 Apr 2019 08:21:33 PM CST
 ************************************************************************/

/*此题的意思就是考验大小端的问题，及函数参数入栈顺序问题，对于64位
 * OS无影响，但对于32或者非64位的OS来说都是一个潜在的大坑，
 * 稍微不注意就掉进去了，首先是从右向左入栈，然后按照%d的大小进行出栈，将值赋予对应的变量，希望多加注意这样的大坑*/
#include<stdio.h>

int main(int argc, char* argv[])
{
    long long a = 1,b=2,c=3;
    printf("%d %d %d\n",a,b,c);

    return 0;
}

